accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/opportunities/ManageEnterpriseOpportunity-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:man="http://xmlns.du.ae/LCE/Business/ServiceManagement/ManageEnterpriseOpportunity">
   <soapenv:Header/>
   <soapenv:Body>
      <web:ManageEnterpriseOpportunityResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <man:Listeitcopportunity_Activityio>
                  <!--Zero or more repetitions:-->
                  <man:Opportunity>
                     <!--Optional:-->
                     <man:Account>?</man:Account>
                     <man:Channel>?</man:Channel>
                     <!--Optional:-->
                     <man:Comments>?</man:Comments>
                     <!--Optional:-->
                     <man:AccountCode>?</man:AccountCode>
                     <!--Optional:-->
                     <man:CustomerAccountIndustry>?</man:CustomerAccountIndustry>
                     <!--Optional:-->
                     <man:CustomerNumberOfEmployees>?</man:CustomerNumberOfEmployees>
                     <man:ServiceSubType>?</man:ServiceSubType>
                     <man:ServiceType>?</man:ServiceType>
                     <!--Optional:-->
                     <man:ContactEmailAddress>?</man:ContactEmailAddress>
                     <!--Optional:-->
                     <man:ContactFirstName>?</man:ContactFirstName>
                     <!--Optional:-->
                     <man:ContactLastName>?</man:ContactLastName>
                     <!--Optional:-->
                     <man:ContactMobile>?</man:ContactMobile>
                     <!--Optional:-->
                     <man:MarketSegment>?</man:MarketSegment>
                     <!--Optional:-->
                     <man:Quantity>?</man:Quantity>
                     <!--Optional:-->
                     <man:PreferredContactTime>?</man:PreferredContactTime>
                     <!--Optional:-->
                     <man:Sponsor>?</man:Sponsor>
                  </man:Opportunity>
               </man:Listeitcopportunity_Activityio>
               <!--Optional:-->
               <man:Error_spcCode>?</man:Error_spcCode>
               <!--Optional:-->
               <man:Error_spcMessage>?</man:Error_spcMessage>
            </lcew:Body>
         </Response>
      </web:ManageEnterpriseOpportunityResponse>
   </soapenv:Body>
</soapenv:Envelope> 